Repository: joaofernandes450/my-portfolio
Catalog: src/locale/locale.*.xlf
Languages: pt

# education-header
source: Education
pt: Educação

# education-subheader
source: Current Diplomas/Degree's
pt: Diplomas

# education-card-header
source: {{d.degree}} in {{d.course}}
pt: {{d.degree}} em {{d.course}}

# date-range
source: From: {{d.startDate | date: 'dd/MM/yyyy'}} - To: {{d.endDate | date: 'dd/MM/yyyy'}}
pt: Desde: {{d.startDate | date: 'dd/MM/yyyy'}} - Até: {{d.endDate | date: 'dd/MM/yyyy'}}

# education-card-actions-button
source: More Information
pt: Mais Informações

# experience-header
source: Experience
pt: Experiência

# experience-subheader
source: Previous Work/Internship
pt: Trabalhos Anteriores/Estágios

# position
source: Position: {{d.position}}
pt: Posição: {{d.position}}

# experience-card-actions-button
source: Project Information
pt: Detalhes do Projeto

# technologies-header
source: Technologies
pt: Tecnologias

# technologies-subheader
source: Current Knowledge
pt: Conhecimento Atual

source: Based on the following scale: 5: Expert 4: Professional (Level 1/2/3 + professional experience) 3: Advanced (Level 1/2 + project experience) 2: Intermediate (Level 1 + small projects or internships) 1: Beginner (Academic experience)
pt: Baseado na seguinte escala: 5: Especialista 4: Profissional (Nível 1/2/3 + experiência profissional) 3: Avançado (Nível 1/2 + experiência em projetos) 2: Intermédio (Nível 1 + projetos de pequena dimensão ou estágios) 1: Iniciante (Experiência acadêmica)

# favorite-stack-header
source: Favorite Stack
pt: Stack Tecnológica Preferida

# favorite-stack-subheader
source: Personal Choice
pt: Escolha Pessoal

# fav-stack-description
source: Since I had my first contact with web development and consequently with the technologies represented, around my third year of graduation to be precise, that I have choosen to stick with them in both academic and personal projects.
pt: Desde o meu primeiro contato em desenvolvimento web e consequentemente com as tecnologias representadas, por volta do meu terceiro ano da licenciatura, que decidi leva-las comigo em projectos academicos e profissionais.

# fav-stack-angular-description
source: Angular was and remains a simple but rather strong framework that allows me to design and develop all of my SPAs in the best way possible. With the introduction of Angular Material and its strong ongoing development, with new versions being pushed regurlary, that I see no motives to move on.
pt: Angular foi e continua a ser uma framework simples, mas bastante forte que me permite desenhar e desenvolver todas as minhas SPAs da melhor maneira possível. Com a introdução do Angular Material e o seu desenvolvimento contínuo, com novas versões lançadas regularmente, que não vejo motivos para procurar uma nova framework.

# fav-stack-node-description
source: Node.js was at the time the chosen backend framework lectured and paired with Angular in our web development. Thanks to its flexibility, scalability and with NPM around I feel that Node.js is the best all around option for my backend development.
pt: Na época o Node.js era a framework lecionada e emparalherada com o Angular no desenvolviment web. Graças à sua flexibilidade, escalabilidade e com a existência do NPM, sinto que o Node.js representa até hoje a melhor escolha para todo o meu desenvolvimento de backend.

# fav-stack-mongo-description
source: MongoDB at the time represented a new concept of mechanism of storage and retrieval of data, since it wasn't based on the common relational databases. But soon enough I found how powerful and fast MongoDB was. Plus the ease of communication between MongoDB and Node.js, using documents with structure similar to JSON, is a big plus.
pt: Num primeiro contacto o MongoDB representava um novo conceito de mecanismos para o armazenamento e consulta de dados, dado que este não era baseado nas tradicionais base de dados relacionais. Mas rapidamente descobri o quão poderoso e rápido o este era. Além disso, a facilidade de comunicação entre o MongoDB e o Node.js, visto que os seus documentos utilizam estruturas semelhantes a JSON, traz uma grande vantagem para a sua adoção.

# dialog-header
source: Context
pt: Contexto

# dialog-activities
source: Activities
pt: Atividades

# dialog-technologies
source: Technologies
pt: Tecnologias
